// Написать программу вычисления значения функции y = f(a)

int a = int.Parse(Console.ReadLine());

double y (int a)// double это тип данных с дробной частью, так? 
{
    double result = 2 / a + a * a;// это сам алгоритм функции только с дробной частью не получилось
    return result;// это что? зачем это
}
Console.WriteLine (y(a));// тут я хочу видеть результат выполнения функции, обращаюсь к методу




